Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི་ དགའ་ ཞེས་ བྱ་བ་ འཁོར་ འབུམ་ སྙེད་ དང་ བཅས་པ་ ཞིག་ བྱུང་བ ར་ གྱུར་ ཏེ །_
en: $1022 “Prāmodyarāja, once in the past there was a thus-gone one by the name of Nectar Joy whose retinue numbered hundreds of thousands.

source: དེ་ ལ་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ རྒྱལ་པོ་ བློ་ ཡངས་ ཞེས་ བྱ་བ ས་ ཁང་ བཟངས་ གསེར་ གྱི་ འོད་ དང་ ལྡན་པ་ ཙན་དན་ དམར་པོ འི་ ཆུས་ བཏབ་པ །_ ཨ་ ག་ རུའི་ བདུག་ པས་ བདུགས་པ་ ཞིག་ ཕུལ་ ལོ །_།
en: A universal monarch named Vast Mind offered that thus-gone one a palace shining with golden light, moistened by the sap of red sandalwood, and perfumed with the incense of myrobalan.

source: ལོངས་ སྤྱད་པ འི་ ཕྱིར་ དགེ་སློང་ གི་ དགེ་འདུན་ ཐམས་ཅད་ ལ་ ཡང་ དེ་ ཁོ་ན་ དང་ འདྲ་བ་ ཞིག་ ཕུལ་བ ར་ གྱུར་ ཏོ །_།
en: For their enjoyment, he also offered each member of the saṅgha of monks the exact same gift.

source: དེ་དག་ ཐམས་ཅད་ ལ་ ཡང་ སྐྱེད་མོས་ཚལ་ རེ་རེ་ ཡང་ ཕུལ་བ ར་ གྱུར་ ཏོ །_། |#| དེས་ བཅོམ་ལྡན་འདས་ དེ་ལས་ ཏིང་ངེ་འཛིན་ བསྟན་པ་ འདི་ ཡང་ ཐོས་ སོ །_།
en: Moreover, he offered every one of them a pleasure garden. |#| Thus, he came to hear this absorption from that blessed one.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ཉིད་ ཀྱི་ རིམ་གྲོ་པ་ མང་ དུ་ ཐོས་པ་ རྣམས་ ཀྱི་ མཆོག་ཤེས་ རབ་ རྫོགས་ ཞེས་ བྱ་བ་ ཞིག་ བྱུང་བ ར་ གྱུར་པ་ དེ་ ལ་ དེས་ འདི་སྐད་ དུ །_
en: $1023 “He then said to the best among the scholars attending that blessed one, someone by the name of Perfect Insight,

source: འདི་ལྟར་ བདག་ གིས་ ཏིང་ངེ་འཛིན་ འདི་ ཤེས་པ ར་ བྱ་ན་ ཁྱིམ་ ན་ གནས་པ ས་ ནི་ འདི་ རྟོགས་པ ར་ དཀའ་ ཡིས །_
en: ‘I must understand this absorption. |#| But doing so is difficult as long as one remains in a household.

source: ཅི་ ནས་ ཀྱང་ བདག་ གིས་ སྐྲ་ དང་ཁ་ སྤུ་ བྲེགས་ ལ་ ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ རབ་ཏུ་ བྱུང་བ ར་ བྱ་ གོར་མ་ཆག་ གོ་ ཞེས་ སྨྲས་ སོ །_།
en: I must by all means shave off my hair and beard, go forth from the household, and become a homeless mendicant. |#| There can be no doubt about this.’

source: དེ་ནས་ སྐྲ་ དང་ཁ་ སྤུ་ བྲེགས་ ནས །_ |#| གོས་ ངུར་སྨྲིག་ བགོས་ ཏེ །_ |#| ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ རབ་ཏུ་ བྱུང་ ནས །_
en: He then did shave off his hair and beard, don the saffron-colored robes, go forth from the household, and become a homeless mendicant.

source: སྲས་ ཁྲི་ དང་ །_ བཙུན་མོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་པོ་ དེ་དག་ ཐམས་ཅད་ དང་ ལྷན་ཅིག་ ཏུ་ རབ་ཏུ་ བྱུང་ སྟེ །_ |#| ཏིང་ངེ་འཛིན་ འདི འི་ རྣམ་ [338b] པ་ དག་ཞུ ས་པ་ དང་ །_
en: All his ten thousand sons and eighty-four thousand queens went forth at the same time, wishing to receive the various aspects of this absorption. [338.b]

source: བཅོམ་ལྡན་འདས་ དེས་ དེ་དག་ གི་ བསམ་པ་ ཐུགས་ སུ་ ཆུད་ ནས །_ |#| ཏིང་ངེ་འཛིན་ འདི་ ཞག་ བདུན་ གྱི་ བར་ དུ་ རྒྱ་ ཆེ ར་ ཡང་དག་ པར་ བསྟན་ ཏོ །_།
en: Knowing their thoughts, that blessed one proceeded to teach them this absorption in detail for a period of seven days.

source: དེ་དག་ གིས་ ཐོས་ ནས་ |#| ཀྱང་ །_ གཅིག་ ལ་ གཅིག་ འདི་སྐད་ དུ །_
en: As they heard this teaching, they said to one another,

source: ཀྱེ་མ་ ཏིང་ངེ་འཛིན་ འདི་ མཐོང་བ ར་ དཀའ་ མོད་ ཀྱི །_
en: ‘Alas, this absorption is difficult to behold.

source: འོན་ཀྱང་ ཏིང་ངེ་འཛིན་ འདི་ ལེགས་པ ར་ བྲིས་ ཏེ་ |#| བཅང་བ ར་ བྱ འོ་ ཞེས་ འཛེར་ ཏོ །_།
en: Nevertheless, we shall write this down carefully, and we shall uphold this.’

source: དེ་དག་ ཐམས་ཅད་ ཀྱིས་ ཏིང་ངེ་འཛིན་ འདི་ བྲིས་ ནས་ ཀྱང་ མཆོད་པ་ བྱས་ སོ །_།
en: $1024 “Hence, they wrote down this absorption and made it their object of worship.

source: བཟུང་ ངོ་ །_། |#| ལུང་ ཡང་ ཕོག་ གོ །_།
en: They retained it and received its transmission.

source: དེ་ནས་ དེ་དག་ ཐམས་ཅད་ དུས་ ལས་ འདས་ ནས །_ |#| སླར་ དེ་དག་ ཚོགས་པ ར་ གྱུར་པ ས་ སངས་རྒྱས་ དྲུག་ འབུམ་ མཉེས་པ ར་ བྱས་པ ར་ གྱུར་ ཏོ །_།
en: After they had passed away, they all came together again, and they pleased six hundred thousand buddhas.

source: ཐམས་ཅད་ དུ་ ཏིང་ངེ་འཛིན་ འདི་ ཐོས་པ ར་ གྱུར་ ཏོ །_། |#| ཐམས་ཅད་ རབ་ཏུ་ བྱུང་ ནས །_ |#| ཏིང་ངེ་འཛིན་ འདི་ ཐོབ་པ ར་ གྱུར་ ཏོ །_།
en: They kept hearing this absorption, and they all went forth and obtained this absorption.

source: སྨོན་ལམ་ ཇི་ལྟ ར་ བཏབ་པ་ བཞིན །_ དགེ་བ འི་ རྩ་བ་ འདི་ཁོ་ན ས་ ཐམས་ཅད་ ཀྱིས་ བྱང་ཆུབ་ རབ་ཏུ་ ཐོབ་པ ར་ གྱུར་ ཏོ །_།
en: In accordance with their prayers and by these roots of virtue alone, they all attained awakening.

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ ཁྱོད་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན །_ |#| འཁོར་ལོ ས་ སྒྱུར་བ འི་ རྒྱལ་པོ་ བློ་ ཡངས་ དེ་ ཁྱོད་ ཀྱིས་ གཞན་ ཡིན་ ནོ་ སྙམ་པ་ དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ་ སྟེ །_
en: $1025 “Prāmodyarāja, do not think that, at that point and at that time, the universal monarch named Vast Mind was someone else.

source: དེ་བཞིན་ གཤེགས་པ་ མར་མེ་མཛད་ དེ །_ |#| དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ རྒྱལ་པོ་ བློ་ ཡངས་ ཞེས་ བྱ་བ ར་ གྱུར་ ཏོ །_། |#| དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ གཟིགས་ དེ་ ནི །_ དགེ་སློང་ རིམ་གྲོ་པ་ ཤེས་རབ་ རྫོགས་ ཞེས་ བྱ་བ ར་ གྱུར་ ཏོ །_།
en: The thus-gone Dīpaṅkara was at that point and on that occasion the universal monarch known as Vast Mind, and the thus-gone Vilocana was the monk and attendant by the name of Perfect Insight.

source: གང་དག་ སྲས་ ཁྲི་པོ་ དེ་དག་ ནི་ བསྐལ་པ་ འདི་ ནས་ བཟུང་ སྟེ །_ |#| བསྐལ་པ་ དྲུག་ཅུ་ རྩ་ ལྔ འི་ བར་ དུ་ འཚང་རྒྱ་བ ར་ མི་ འགྱུར་ རོ །_།
en: His ten thousand sons will remain unable to reach awakening for thirty-five eons, counting from the present one.

source: དེ འི་ འོག་ ཏུ་ བསྐལ་པ་ གྲགས་པ་ ཆེན་པོ་ ཞེས་ བྱ་བ་ ཞིག་ འབྱུང་བ ར་ འགྱུར་ ཏེ །_ |#| བསྐལ་པ་ གཅིག་པོ་ དེ་ ལ་ དེ་དག་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ །_།
en: Then will follow an eon called Great Renown, and |#| during that single eon all of them will awaken to perfect and complete buddhahood.

source: གང་དག་ བློན་པོ་ བརྒྱད་ ཁྲི་པོ་ དེ་དག་ ནི །_ བསྐལ་པ་ གྲགས་པ་ ཆེན་པོ་ འདས་ ནས །_ |#| བསྐལ་པ་ བརྒྱད་ཅུ འི་ བར་ དུ་ འཚང་རྒྱ་བ ར་ མི་ འགྱུར་ རོ །_།
en: After the eon called Great Renown is over, the eighty thousand ministers will remain unable to reach awakening for eighty eons.

source: དེ འི་ འོག་ ཏུ་ བསྐལ་པ་ སྐར་མ་ ལྟ་བུ་ ཞེས་ བྱ་བ་ ཞིག་ འབྱུང་བ ར་ འགྱུར་ ཏེ །_ |#| དེ་ ལ་ བློན་པོ་ བརྒྱད་ ཁྲི་པོ་ དེ་དག་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ །_།
en: Then will follow an eon called Star-Like, during which those eighty thousand ministers will awaken to perfect and complete buddhahood. [339.a]

source: བསྐལ་པ་ [339a] སྐར་མ་ ལྟ་བུ་ འདས་ ནས །_ |#| བསྐལ་པ་ སུམ་བརྒྱ་ ནི་ སངས་རྒྱས་ འབྱུང་བ ར་ མི་ འགྱུར་ རོ །_།
en: After the eon called Star-Like will follow three hundred eons during which no buddhas will appear.

source: དེ འི་ འོག་ ཏུ་ བསྐལ་པ་ ཡོན་ཏན་ བཀོད་པ་ ཞེས་ བྱ་བ་ ཞིག་ འབྱུང་བ ར་ འགྱུར་ རོ །_།
en: Then there will be an eon known as Array of Qualities,

source: དེ་ ལ་ བཙུན་མོ་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་པོ་ དེ་དག་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ །_།
en: and during that time the eighty-four thousand queens will awaken to perfect and complete buddhahood.

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ བྱང་ཆུབ་ སེམས་དཔ འི་ ཏིང་ངེ་འཛིན་ འདི་ ནི་ དེ་ལྟ ར་ འབྲས་བུ་ཆེ་བ་ ཡིན་ ནོ །_།
en: Prāmodyarāja, such are the fruits born by this absorption of the bodhisattvas.

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ དེ་ལྟ་བས་ན་ བྱང་ཆུབ་ སེམས་དཔ འི་ ལྷག་པ འི་ བསམ་པ་ རྫོགས་པ །_
en: $1026 “Prāmodyarāja, in this way the superior wishes of the bodhisattvas are fulfilled.

source: ལུས་ དང་ སྲོག་ ལ་ མི་ལྟ་བ ར་ གྱུར་པ ས །_ ཏིང་ངེ་འཛིན་ འདི་ བཙལ་བ ར་ བྱ འོ །_།
en: Without regard for your own body or life, pursue this absorption.

source: བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འདོད་པ ས །_ ཏིང་ངེ་འཛིན་ འདི་ ལ་ རྣལ་འབྱོར་ དུ་ བྱ འོ །_།
en: If you wish to awaken to unexcelled and perfect buddhahood, then you should adhere to the practice of this absorption.”

source: སངས་རྒྱས་ བྱང་ཆུབ་ དོན་ དུ་ གཉེར་བ་ གང་ །_། དེ་དག་ རྒྱལ་པོ་ དེ་ ཡི་ རྗེས་སུ་ སློབ །_།
en: “Those in pursuit of the buddhas’ awakening |#| Should train in the footsteps of those kings.

source: ཡང་དག་ བསྒྲུབ་ ལ་ གནས་པ་ མ་གཏོགས་ པར །_། གཞན་ གྱིས་ བྱང་ཆུབ་ མཆོག་ ནི་ འཐོབ་ མི་ འགྱུར །_།
en: For, besides adhering to true practice, |#| There is no way to achieve supreme awakening.

source: དེ་ལྟ ར་ འདིར་ ནི་ དད་པ་ ཆུང་ བསྐྱེད་ ཀྱང་ །_། དེ་བཞིན་ རྣམ་སྨིན་ གྱ་ནོམ་ འཐོབ་པ ར་ འགྱུར །_།
en: $1028 “Even if one’s faith in this is weak, |#| The ripening achieved will be sublime.

source: དེ་བ ས་ གཡོ་མེད་ ལྷག་པ འི་ བསམ་པ་ ཡིས །_། འདིར་ ནི་ ཅི་རིགས་ བཀུར་སྟི ས་ རྣལ་འབྱོར་ གྱིས །_།
en: Therefore, with unswerving, superior intent, |#| Engage in this spiritual practice with all manner of respect.

source: རྒྱལ་བ་ གང་དེ་ བདག་ གིས་ འདིར་ བསྒྲགས་པ །_། དེ་དག་ གང་ཞིག་ མཐོང་བ ར་ འདོད་པ་ དང་ །_། བསྟན་པ་ རྒྱ་ ཆེ ར་ འཆད་པ ར་ འདོད་པ་ དག _། |#| ཇི་སྐད་ བསྟན་ བཞིན་ འདི་ ལ་ རྣལ་འབྱོར་ གྱིས །_།
en: $1029 “Those who wish to see the victors |#| Of whom I have here spoken, |#| And who wish for extensive explanation, |#| Should, just as taught, take up this spiritual practice.

source: ཡི་ རང་ཉིད་ ཀྱིས་ ཕུན་སུམ་ ཚོགས་ འགྱུར་ ན །_། |#| འཆང་ དང་ ཀློག་པ་ ལྟ་ ཞིག་ ཅི་ སྨོས་ ཏེ །_།
en: $1030 “Since merely rejoicing brings such excellence, |#| What need is there to mention the effects of holding and reading this?

source: ཡོན་ཏན་ མཐའ་ ནི་ འགྲོ་བ ས་ བསམ་ མི་ ནུས །_།
en: No wandering being can conceive of the extent of these qualities.

source: འདི་ ཐོས་ སུ་ཞིག་ རྣལ་འབྱོར་ སྦྱོར་ མི་ བྱེད །_།
en: Upon hearing this, who would not engage in this spiritual practice?

source: བྱང་ཆུབ་ སོ་སོ་ ཡང་དག་ རིག་ མཚན་ དང་ །_། སྟོན་ དང་ ཕ་རོལ་ སེམས་ ནི་ གླེང་བ་ དང་ །_། སྒྲུབ་ དང་ སྣང་བ་ གང་དག་ སངས་རྒྱས་ ཆོས །_། ཏིང་ངེ་འཛིན་ འདི་ ལས་ ནི་ བཙལ་བ ར་ བྱ །_།
en: $1031 “Awakening, correct knowledge, distinctive features, |#| Teaching, inspiring the minds of others, |#| Practice, and illumination—all these buddha qualities |#| Should be pursued through this absorption.

source: ལས་ སྦྱོང་ དེ་བཞིན་ བདུད་ རྣམས་ འཇོམས་པ་ དང་ །_། ལྟ་ སྦྱོང་ དེ་བཞིན་ སྲིད་པ་ [339b] ཟད་ བྱེད་ དང་ །_། རྣམ་པར་ རོལ་ དང་ ཞིང་ བཀོད་ འབྱོར་པ་ དག _། |#| འདི་ དང་ རབ་ཏུ་ ལྡན་ ལ་ དཀོན་ མ་ ཡིན །_།
en: $1032 “Purification of karma, defeating the māras, |#| Purifying beliefs, bringing existence to the point of exhaustion, [339.b] |#| Reveling, and the rich arrays of the pure fields— |#| None of these are rare for the one who is in possession of this.

source: དེ་བཞིན་ རྣམ་གྲོལ་ སྤོབས་པ་ ཕུན་ཚོགས་ དང་ །_། བྱ་བ་ ཐམས་ཅད་ སྦྱོང་བྱེད་ གཟུགས་ དག་ དང་ །_། བསམ་པ་ ཇི་བཞིན་ བྱང་ཆུབ་ འཚང་རྒྱ་བ །_། དེ་དག་ ཐམས་ཅད་ འདིར་ གནས་ མོད་པ་ ཡིན །_།
en: $1033 “Likewise, liberation, perfect acumen, |#| Universal mastery of actions, |#| Bodies suited to one’s wishes, and awakening to buddhahood— |#| All of these are abundant for the one who abides by this.

source: ང་ ཡིས་ དེ་སྙེད་ ཚིག་ གིས་ རྗོད་ ནུས་ རྣམས །_། དེ་ལྟ་བས་ན་ དེ་དག་ འདིར་ སྒྲུབས་ ཤིག _།
en: $1034 “As I have spoken here of these matters in abundant words, |#| Do follow them up here and accomplish them!

source: ཀུན་མཁྱེན་ ཆོས་ ལ་ དགའ་བ ར་ མ་ བྱས་ ན །_། |#| ཕྱི་དུས་ དག་ ན་ འགྱོད་པ ར་ གྱུར་ ཏ་ རེ །_།
en: Those who do not delight in the qualities of omniscience |#| Will surely have regrets in the future.

source: ཕ་རོལ་ ཕྱིན་པ་ ཇི་སྙེད་ ངས་ བསྟན་ དང་ །_། གང་དག་ ཡེ་ཤེས་ རྒྱ་མཚོ་ སྦྱོར་ལམ་ དག _། |#| ལུས་རྟེན་ བྱིས་པ འི་ སྤྱོད་ ལ་ གནས་པ་ ཡིས །_། ཤེས་པ ར་ བྱ་བ་ དག་ ཏུ་ ནུས་ མ་ ཡིན །_།
en: $1035 “The many perfections I have taught, |#| Along with the paths for reaching the ocean of wisdom, |#| Remain beyond the scope of comprehension |#| Of corporeal beings engaged in infantile conduct.

source: དུས་ ངན་པ་ དང་སེམས་ ཅན་ མ་རུངས་ དང་ །_། ཆོས་ ནུབ་ མཐའ་ དང་ ངན་སོང་ འཕེལ་བ་ ན །_།
en: $1036 “In evil times when beings are wicked, |#| When the Dharma is about to disappear and the lower realms are looming,

source: མཁས་པ ས་ ཤིན་ཏུ་ ཡིད་ བྱུང་ བྱས་ ནས་ ཀྱང་ །_། བག་ ཡོད་ རི་ དག ས་ བཞིན་ དུ་ སྐྲག་པ ར་ འགྱུར །_།
en: The wise will feel deep remorse. |#| They will be cautious and timid, like deer.

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ །_ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ཞིག་ གིས་ བསྐལ་པ་ སྟོང་ དུ་ ཐབས་མཁས་པ་ མ་གཏོགས་ པར །_ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དྲུག་ དག་ ལ་ སྤྱད་པ་ བས་ ནི །_ ཏིང་ངེ་འཛིན་ འདི་ ཐོས་ ནས་ |#| རྗེས་སུ་ ཡི་ རང་བ ར་ བྱས་པ འི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ འདི་ ལ །_ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ སྔ་མ་ དེས་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ་བ་ ནས །_ |#| དཔེ འི་ བར་ དུ་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ འོ །_།
en: $1037 “Prāmodyarāja, compared to the amount of merit accomplished by a bodhisattva who has practiced the six perfections with comprehensive skill throughout one thousand eons, the merit that arises when hearing about this absorption and rejoicing is far greater—beyond all comparison.”

source: ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ བསྟན་པ་ ན །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ གྲངས་མེད་པ་ དག་ གིས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ དེ །_
en: $1038 When the Blessed One gave this Dharma teaching, innumerable bodhisattvas gave rise to the mind of unexcelled perfect and complete awakening, and

source: དེ་དག་ ཐམས་ཅད་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ལས་ ཕྱིར་ མི་ ལྡོག་པ ར་ གྱུར་ ཏོ །_།
en: they all irreversibly attained unexcelled perfect and complete awakening.

source: ལྷ་ དང་ མི འི་ སྐྱེ་དགུ འི་ ཚོགས་ བརྒྱད་ འབུམ་ སྙེད་ ཀྱང་ །_ རྡུལ་མེད་ ཅིང་ དྲི་མ་ དང་ བྲལ་ ལ་ ཆོས་ རྣམས་ ལ་ ཆོས་ ཀྱི་ མིག་ རྣམ་པར་ དག་ གོ _།
en: Moreover, eight hundred thousand gods and humans attained the pure Dharma eye that beholds phenomena immaculately and without stain.

source: ལྷ་ དེ་དག་ ཆོས་ ཀྱི་ མིག་ རྣམ་པར་ དག་པ ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཆོས་ ལ་ མངོན་པར་ དགའ་བ འི་ ཕྱིར་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དག་ མེ་ཏོག་ གིས་ ཆལ་ པར་ བཀྲམ་ [340a] པར་ གྱུར་ ཏོ །_།
en: Since the eyes of those gods were now pure, they delighted in the Blessed One’s Dharma and scattered flowers throughout this trichiliocosm. [340.a]

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ཡང་ རྣམ་པ་ དྲུག་ ཏུ་ གཡོས་ སོ །_། |#| བར་སྣང་ ལས་ ཀྱང་ ལྷ འི་ རྔ་སྒྲ་ དག་ བསྒྲགས་ སོ །_།
en: The trichiliocosm shook in six distinctive ways, and the sounds of divine drums filled the air.

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱེ་བ་ སྙེད་ ཐམས་ཅད་ ཀྱིས་ ཀྱང་ ཏིང་ངེ་འཛིན་ འདི་ ཐོབ་བོ །_།
en: Prāmodyarāja, along with all the millions of other bodhisattvas, attained this meditative absorption.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནས །_ |#| མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ ལ་སོགས་པ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཐམས་ཅད་ དང་ །_ ལྷ་ དང་ །_ མི་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ དྲི་ཟ ར་ བཅས་པ འི་ འཇིག་རྟེན་ ཐམས་ཅད་ བཅོམ་ལྡན་འདས་ ཀྱིས་ གསུངས་པ་ ལ་ ཡི་ རངས་ ཏེ་ མངོན་པར་ བསྟོད་ དོ །།_།།
en: $1039 When the Blessed One had said these words, Prāmodyarāja and all the other bodhisattva great beings—as well as the whole world with its gods, humans, asuras, and gandharvas—rejoiced and praised the words of the Blessed One.

source: འཕགས་པ་ བསྐལ་པ་ བཟང་པོ་པ་ ཞེས་ བྱ་བ་ ཐེག་པ་ ཆེན་པོ འི་ མདོ་ རྫོགས་ སྷོ །།_།།
en: $1040 This completes the noble sūtra of the Great Vehicle, known as “The Good Eon.”

source: རྒྱ་གར་ གྱི་ མཁན་པོ་ བིདྱཱ་ ཀ་ར་ སིང་ ཧ་ དང་ །_ ལོཙྪ་བ་ བན་དེ་ དཔལ་ གྱི་ དབྱངས་ ཀྱིས་ བསྒྱུར །_ |#| ཞུ་ཆེན་ གྱི་ ལོཙྪ་བ་ བན་དེ་ དཔལ་ བརྩེགས་ ཀྱིས་ ཞུས་ ཏེ་
en: {{milestone:{label:c.1,id:UT22084-045-001-4492}}}This translation was produced by the Indian preceptor Vidyākara­siṁha and the translator Venerable Palgyi Yang. |#| The translation was revised and finalized by the great translator-editor Venerable Paltsek.

source: གཏན་ ལ་ ཕབ་པ །།_།། ཤུ་ བྷ་ མསྟུ་ སརྦ་ ཛ་ ག་ ཏཱཾ །།_།། ཡེ་ དྷརྨཱ་ ཧེ་ ཏུ་ པྲ་ བྷ་ ཝཱ་ ཧེ་ དུནྟེ་ ཥཱན་ ཏ་ ཐཱ་ ག་ ཏོ་ ཧྱ་ བད་ ཏ །_ ཏེ་ ཥཱཉྩ་ ཡོ་ ནི་ རོ་ དྷ་ ཨེ་ ཝཱཾ་ བཱ་ དཱི་ མ་ ཧཱ་ ཤྲ་ མ་ ཎཿ །_ མག་ ལ་ བྷ་ བནྟུ །།_།
en: {{milestone:{label:c.2,id:UT22084-045-001-4493}}}Śubhaṁ astu sarvaja gatāṁ |#| {{milestone:{label:c.3,id:UT22084-045-001-4494}}}Oṃ ye dharmā hetuprabhavā |#| hetuṃ teṣāṃ tathāgato hy avadat, |#| teṣāṃ ca yo nirodha |#| evaṃvādī mahāśramaṇaḥ |#| {{milestone:{label:c.4,id:UT22084-045-001-4495}}}Maṅgala bhavatu
